// alert ('Hello Ivan') -виведення діалогового вікна 

// let a = 3;
// let b = 90;

// let s = a + b;
// //alert ('Sum = ' + s);
// alert (`Sum = ${s}`)

// console.log (`Sum = ${a}`)// - Виведення у консоль розробника 

// document.write (` <h1> Sum = ${a}</h1> ` ) // - Виведенння у розмітку з додаванням h1

// let userName = prompt ('Як вас звати?', 'Гість')

//========================================================================================================================================================


// let a = parseInt (prompt('First number' , '0'));
// let b = parseInt (prompt ('Second number' , '0'));

// let s = a + b;

// document.write (`Sum = ${s}`);

//========================================================================================================================================================

// Підрахувати загальну вагу мішеів картоплі

// let boxCount = parseInt(prompt('Кількість ящиків'));
// let boxWeight = parseFloat(prompt('Вага одного ощика'));

// let sum = boxCount * boxWeight;

// document.write (`Total weight = ${sum}`);

//========================================================================================================================================================

// toFixed()  - закругляє до вказаної кількості

// let boxCount = parseInt(prompt('Кількість ящиків'));
// let boxWeight = parseFloat(prompt('Вага одного ощика'));

// let sum = boxCount * boxWeight;

// document.write (`Total weight = ${sum.toFixed(2)}`);

//========================================================================================================================================================

